#+TITLE: CODING LOOPS "break" "next" "repeat" - PRACTICE AND EXERCISES
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: DSC 205 - Advanced introduction to data science
#+STARTUP: overview hideblocks indent inlineimages
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :session *R* :results output :exports both :noweb yes
** ~while~ without ~break~ or ~next~
In the text, we divided ~foo~ by ~bar~, where:
#+begin_src R
  <<foobar>>
  foo
  bar
#+end_src

#+RESULTS:
: [1] 5
: [1] 2.0 3.0 1.1 4.0 0.0 4.1 3.0

1) Write a ~while~ loop - without using ~break~ or ~next~ that will produce
   the same vector as ~loop1.result~ ([[https://github.com/birkenkrahe/ds2/blob/main/org/8_loop_break.org#example-break][see GitHub]]): compute ~foo/bar~ and
   make sure you break off as soon as ~Inf~ is produced.
   #+begin_src R
     <<loop1.result>>
   #+end_src

   #+RESULTS:
   : [1] NA NA NA NA NA NA NA
   : [1] 2.500000 1.666667 4.545455 1.250000       NA       NA       NA

   #+begin_src R

   #+end_src

2) Obtain the same result as ~loop2.result~ using an ~ifelse~ function
   instead of a loop.
   #+begin_src R
     <<loop2.result>>
   #+end_src

   #+RESULTS:
   : [1] NA NA NA NA NA NA NA
   : [1] 2.500000 1.666667 4.545455 1.250000       NA 1.219512 1.666667

   #+begin_src R

   #+end_src

